Pandas DataFrame Cheat Sheet

In [1]:
import pandas as pd
import numpy as np

pd.set_option("display.precision", 4)
pd.set_option("display.max_rows", 15)

create df

In [2]:
pd.DataFrame({'ColA': [1, 2, 3], 'ColB': [4, 5, 6], 'ColC': [7, 8, 9]})

   ColA  ColB  ColC
0     1     4     7
1     2     5     8
2     3     6     9

In [3]:
pd.DataFrame({'ColA': [1, 2, 3], 'ColB': [4, 5, 6], 'ColC': [7, 8, 9]},
             ['a', 'b',' c'])

    ColA  ColB  ColC
a      1     4     7
b      2     5     8
 c     3     6     9

In [4]:
pd.DataFrame([[1, 2, 3], [4, 5, 6], [7, 8, 9]])

   0  1  2
0  1  2  3
1  4  5  6
2  7  8  9

In [5]:
ps1 = pd.Series([1, 2, 3])
ps2 = pd.Series([4, 5, 6])
pd.DataFrame({'ColA': ps1, 'ColB': ps2})

   ColA  ColB
0     1     4
1     2     5
2     3     6

In [6]:
ps1 = pd.Series([1, 2, 3], [1, 2, 3])
ps2 = pd.Series([1, 2, 3], [2, 1, 3])
pd.DataFrame({'ColA': ps1, 'ColB': ps2})
# NOTE: Series are re-ordered and matched by Indices!

   ColA  ColB
1     1     2
2     2     1
3     3     3

In [7]:
df = pd.DataFrame([[1, 2, 3], [4, 5, 6], [7, 8, 9]],
                  index=['a', 'b',' c'],
                  columns=['ColA', 'ColB', 'ColC'])
df

    ColA  ColB  ColC
a      1     2     3
b      4     5     6
 c     7     8     9

Rename Column/Index

In [8]:
df.rename({'ColC': 'CCC'}, axis=1)

    ColA  ColB  CCC
a      1     2    3
b      4     5    6
 c     7     8    9

In [9]:
df.rename({'b': 'B'}, axis='index')
#df.rename({'b': 'B'}, axis=0)

    ColA  ColB  ColC
a      1     2     3
B      4     5     6
 c     7     8     9

Assign/Reset Index

In [10]:
df.index = ['A', 'B', 'C']
df

   ColA  ColB  ColC
A     1     2     3
B     4     5     6
C     7     8     9

In [11]:
df.reset_index()
# Resets index and create new 'index' column to store old indexes

  index  ColA  ColB  ColC
0     A     1     2     3
1     B     4     5     6
2     C     7     8     9

In [12]:
df.reset_index(drop=True)
# Dispense with creating 'index' column

   ColA  ColB  ColC
0     1     2     3
1     4     5     6
2     7     8     9

Access Whole Column(s)

In [13]:
df

   ColA  ColB  ColC
A     1     2     3
B     4     5     6
C     7     8     9

In [14]:
df['ColA']

A    1
B    4
C    7
Name: ColA, dtype: int64

In [15]:
df.ColA

A    1
B    4
C    7
Name: ColA, dtype: int64

In [16]:
df.iloc[:,0]

A    1
B    4
C    7
Name: ColA, dtype: int64

In [17]:
df.loc[:,'ColA':'ColB']

   ColA  ColB
A     1     2
B     4     5
C     7     8

In [18]:
df[['ColA','ColB']]

   ColA  ColB
A     1     2
B     4     5
C     7     8

Access Whole Row(s)

In [19]:
df.iloc[0]

ColA    1
ColB    2
ColC    3
Name: A, dtype: int64

In [20]:
df.loc['A']

ColA    1
ColB    2
ColC    3
Name: A, dtype: int64

In [21]:
df.loc['A':'B']

   ColA  ColB  ColC
A     1     2     3
B     4     5     6

In [22]:
df[0:2]

   ColA  ColB  ColC
A     1     2     3
B     4     5     6

In [23]:
df.loc[df['ColB']>4]

   ColA  ColB  ColC
B     4     5     6
C     7     8     9

Access Single Cell

In [24]:
df.at['C', 'ColA']  # FASTEST
#df.loc['C', 'ColA']
#df.loc['C']['ColA']
#df['ColA']['C']

7

In [25]:
df.iat[2,0]

7

In [26]:
df.at['C','ColA']=89
df

   ColA  ColB  ColC
A     1     2     3
B     4     5     6
C    89     8     9

In [27]:
df.iat[2, 0] = 7
df

   ColA  ColB  ColC
A     1     2     3
B     4     5     6
C     7     8     9

# Access Partial Column

In [28]:
df.loc['A','ColA':'ColB']

ColA    1
ColB    2
Name: A, dtype: int64

In [29]:
df.iloc[0]['ColA':'ColB']

ColA    1
ColB    2
Name: A, dtype: int64

In [30]:
df.iloc[0,0:2]

ColA    1
ColB    2
Name: A, dtype: int64

In [31]:
df.iloc[0,[0,2]]

ColA    1
ColC    3
Name: A, dtype: int64

# Access Partial Frame

In [32]:
df.iloc[1:,1:]

   ColB  ColC
B     5     6
C     8     9

In [33]:
df.loc['B':'C','ColB':'ColC']

   ColB  ColC
B     5     6
C     8     9

# Dropping Rows / Columns

In [34]:
df

   ColA  ColB  ColC
A     1     2     3
B     4     5     6
C     7     8     9

In [35]:
df.drop('A')

   ColA  ColB  ColC
B     4     5     6
C     7     8     9

In [36]:
df.drop('ColA',axis=1)

   ColB  ColC
A     2     3
B     5     6
C     8     9

In [37]:
df.drop(columns=['ColA', 'ColC'])

   ColB
A     2
B     5
C     8

# Data Exploration

In [38]:
df.shape

(3, 3)

In [39]:
df.values

array([[1, 2, 3],
       [4, 5, 6],
       [7, 8, 9]], dtype=int64)

In [40]:
df.columns

Index(['ColA', 'ColB', 'ColC'], dtype='object')

In [41]:
df.columns.values.tolist()

['ColA', 'ColB', 'ColC']

In [42]:
df1=df.copy()
df1.iat[0,0]=np.NaN
df1.count()
# counting only non-NaN values

ColA    2
ColB    3
ColC    3
dtype: int64

In [43]:
df.info()

<class 'pandas.core.frame.DataFrame'>
Index: 3 entries, A to C
Data columns (total 3 columns):
 #   Column  Non-Null Count  Dtype
---  ------  --------------  -----
 0   ColA    3 non-null      int64
 1   ColB    3 non-null      int64
 2   ColC    3 non-null      int64
dtypes: int64(3)
memory usage: 204.0+ bytes

In [44]:
df.describe()

       ColA  ColB  ColC
count   3.0   3.0   3.0
mean    4.0   5.0   6.0
std     3.0   3.0   3.0
min     1.0   2.0   3.0
25%     2.5   3.5   4.5
50%     4.0   5.0   6.0
75%     5.5   6.5   7.5
max     7.0   8.0   9.0

In [45]:
df.agg((min,max))

     ColA  ColB  ColC
min     1     2     3
max     7     8     9

In [46]:
df1 = pd.DataFrame({'ColA': ['one', 'two', 'one']})
df1.describe()

       ColA
count     3
unique    2
top     one
freq      2

In [47]:
df['ColA'].value_counts()
# Returns Series containing Count of unique values with index set to values

1    1
4    1
7    1
Name: ColA, dtype: int64

In [ ]:
vc = df[['ColA', 'ColC']].value_counts()
vc
# Returns Series containing Count of unique multi-col value combos with index
# set to the combos

ColA  ColC
1     3       1
4     6       1
7     9       1
dtype: int64

In [ ]:
df.head(3)

In [ ]:
df.tail(2)

In [ ]:
df.hist(bins=9);
# Histograms of all columns

# Data Visualization

In [ ]:
df.plot(kind='scatter', x='ColA', y='ColB', s=200, alpha=0.5);

In [ ]:
df1 = df.applymap(lambda x: np.sin(x))
df1.corr()

In [ ]:
import seaborn as sns
sns.heatmap(abs(df1.corr()), annot=True, fmt=".2f", cmap='gray', cbar=False);

In [ ]:
from pandas.plotting import scatter_matrix
print(df)
scatter_matrix(df)

In [ ]:
df.groupby('ColA').count().iloc[:, 0].plot(kind='bar');
# Chart of value counts of particular column

# Boolean Indexing

In [ ]:
df

In [ ]:
df['ColA']>2

In [ ]:
df.loc[df['ColA'] > 2, 'ColA']

In [ ]:
df>4

In [ ]:
gt4 = df > 4
df[~gt4]

In [ ]:
df1 = df.copy()
df1[gt4] = -1
df1

In [ ]:
df[(df['ColA'] > 1) & (df['ColA'] < 10)]

In [ ]:
df.loc[df['ColA'] > 1]

# Sorting

In [ ]:
df

In [ ]:
df.sort_values('ColA',ascending=True,inplace=True)
df

In [ ]:
df.sort_index(inplace=True)
df

In [ ]:
df.rank()

# Computation

In [ ]:
df

In [ ]:
print(df['ColA'].min())
print(df['ColA'].max())
print(df['ColA'].sum())
print(df['ColA'].mean())
print(df['ColA'].median())
print(df['ColA'].mode())
print("cumSum() \n",df.cumsum(axis=1))

# Substitution

In [ ]:
df['ColA'].map({1:'One',4:'Four'})

In [ ]:
df['ColA'].apply(lambda x:x**2)

In [ ]:
df.apply(sum)

# Grouping

In [ ]:
df = pd.DataFrame({'ColA': ['X', 'Y', 'X'], 'ColB': [1, 2, 3], 'ColC': [4, 5, 6]})
df

In [ ]:
df.groupby('ColA').sum()

In [ ]:
df.groupby('ColA')['ColB'].sum()

In [ ]:
df.groupby('ColA').max()

In [ ]:
df = pd.DataFrame({'ColA': ['X','X','Y','X'],
                   'ColB': ['Y','Y','Y','Z'],
                   'ColC': [1,2,3,4],
                   'ColD': [5,6,7,8]})
df

In [ ]:
df.groupby(['ColA', 'ColB'])['ColC'].count()

In [ ]:
df.groupby(['ColA', 'ColB'])['ColC'].max()